phracker/MacOSX-SDKs/MacOSX10.11.sdk/System/Library/Frameworks/Kernel.framework/Versions/A/Headers/IOKit/usb/IOUSBHostPipe.h
/*
 * Copyright (c) 1998-2006 Apple Computer, Inc. All rights reserved.
 *
 * @APPLE_LICENSE_HEADER_START@
 *
 * The contents of this file constitute Original Code as defined in and
 * are subject to the Apple Public Source License Version 1.2 (the
 * "License").  You may not use this file except in compliance with the
 * License.  Please obtain a copy of the License at
 * http://www.apple.com/publicsource and read it before using this file.
 *
 * This Original Code and all software distributed under the License are
 * distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY KIND, EITHER
 * EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
 * INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
 * Please see the License for the specific language governing rights and
 * limitations under the License.
 *
 * @APPLE_LICENSE_HEADER_END@
 */

/*!
 * @header IOUSBHostPipe.h
 *
 * @brief Provides IOUSBHostPipe API
 */
#ifndef IOUSBHostFamily_IOUSBHostPipe_h
#define IOUSBHostFamily_IOUSBHostPipe_h

#include <IOKit/IOService.h>
#include <IOKit/IOMemoryDescriptor.h>

#include <IOKit/usb/StandardUSB.h>
#include <IOKit/usb/IOUSBHostFamily.h>
#include <IOKit/usb/IOUSBHostIOSource.h>
#include <IOKit/usb/IOUSBHostStream.h>

class IOUSBHostInterface;
class AppleUSBHostController;

/*!
 * @class IOUSBHostPipe
 *
 * @brief IOUSBHostPipe object
 *
 * @discussion Provides the API for controlling pipe policy and performing I/O.
 */
class IOUSBHostPipe : public IOUSBHostIOSource
{
    friend class IOUSBHostInterface;
    friend class IOUSBHostDevice;
    friend class AppleUSBHostController;
    friend class AppleUSBIORequest;

    OSDeclareDefaultStructors(IOUSBHostPipe)

public:
    static IOUSBHostPipe* withDescriptorsAndOwners(const StandardUSB::EndpointDescriptor* descriptor, const StandardUSB::SuperSpeedEndpointCompanionDescriptor* companionDescriptor,
                                                   AppleUSBHostController* controller, IOUSBHostDevice* device, IOUSBHostInterface* interface, UInt8 speed, tUSBHostDeviceAddress address);

protected:
    virtual bool initWithDescriptorsAndOwners(const StandardUSB::EndpointDescriptor* descriptor, const StandardUSB::SuperSpeedEndpointCompanionDescriptor* companionDescriptor,
                                              AppleUSBHostController* controller, IOUSBHostDevice* device, IOUSBHostInterface* interface, UInt8 speed, tUSBHostDeviceAddress address);
    
#pragma mark IOUSBHostIOSource overrides
public:
    virtual void free();
    
    /*!
     * @brief Abort pending I/O requests.
     *
     * @discussion See IOUSBHostIOSource::abort for documentation
     */
    virtual IOReturn abort(IOOptionBits options = kAbortAsynchronous, IOReturn withError = kIOReturnAborted, IOService* forClient = NULL);
    
protected:
    virtual IOReturn closeGated();
    
    virtual IOReturn abortGated(IOOptionBits options, IOReturn withError, IOService* forClient);

    UInt8               _speed;
    IOUSBHostInterface* _interface;

#pragma mark Descriptors and policies
public:
    /*!
     * @methodgroup Descriptors and Policies
     */
    
    /*!
     * @brief Options for <code>getEndpointDescriptor()</code> and <code>getSuperSpeedEndpointCompanionDescriptor()</code>
     *
     * @discussion
     * @constant kGetEndpointDescriptorOriginal - Original descriptor as returned as part of the configuration descriptor.
     * @constant kGetEndpointDescriptorCurrentPolicy - Descriptor controlling the current endpoint policy.  This may differ from
     * kGetEndpointDescriptorOriginal if <code>adjustPipe()</code> has been called.
     */
    enum tGetEndpointDescriptorOptions
    {
        kGetEndpointDescriptorOriginal = 0,
        kGetEndpointDescriptorCurrentPolicy
    };
    
    /*!
     * @brief This method will return an endpoint descriptor associated with the pipe.
     *
     * @param type The desired endpoint descriptor type to return.  See @link //apple_ref/cpp/tag/IOUSBHostPipe/tGetEndpointDescriptorOptions
     * IOUSBHostPipe::tGetEndpointDescriptorOptions @/link for more details.
     *
     * @return If successful a pointer to the endpoint descriptor is returned.  Otherwise, NULL is returned.
     */
    virtual const StandardUSB::EndpointDescriptor* getEndpointDescriptor(tGetEndpointDescriptorOptions type = kGetEndpointDescriptorCurrentPolicy);
    
    /*!
     * @brief This method will return the Super-Speed endpoint companion descriptor associated with the pipe.
     *
     * @param type The desired endpoint descriptor type to return. See @link //apple_ref/cpp/tag/IOUSBHostPipe/tGetEndpointDescriptorOptions
     * IOUSBHostPipe::tGetEndpointDescriptorOptions @/link for more details.
     *
     * @return If successful a pointer to the companion descriptor is returned.  Otherwise, NULL is returned.
     */
    virtual const StandardUSB::SuperSpeedEndpointCompanionDescriptor* getSuperSpeedEndpointCompanionDescriptor(tGetEndpointDescriptorOptions type = kGetEndpointDescriptorCurrentPolicy);
    
    /*!
     * @brief This method is used to change the amount of bandwidth currently allocated to the pipe.
     *
     * @discussion This method is only valid for interrupt and isochronous endpoints.  There is only a finite amount of
     * bandwith available for interrupt and isochronous endpoints on the USB bus TODO
     *
     * @param endpointDescriptor Pointer to an endpoint descriptor describing the bandwidth request
     *
     * @param companionDescriptor Pointer to a companion descriptor describing the bandwidth request
     *
     * @return IOReturn result code
     */
    virtual IOReturn adjustPipe(const StandardUSB::EndpointDescriptor* endpointDescriptor, const StandardUSB::SuperSpeedEndpointCompanionDescriptor* companionDescriptor);
    
    /*!
     * @brief Set the idle policy of the pipe
     *
     * @discussion TODO Detailed discussion about idling.  This method is only valid for interrupt and bulk endpoints.
     *
     * @param idleTimeoutMs The time, in milliseconds, after which if no I/O has completed the IOUSBHostPipe is consider idle.
     *
     * @return IOReturn result code
     */
    virtual IOReturn setIdlePolicy(uint32_t idleTimeoutMs);
    
    /*!
     * @brief Get the idle policy of the pipe
     *
     * @discussion This method is only valid for interrupt and bulk endpoints.
     *
     * @return The current idle timeout in milliseconds
     */
    virtual uint32_t getIdlePolicy();
    
    /*!
     * @brief Clear the halt condition of the pipe.
     *
     * @discussion  This method will abort all pending I/O, clear the halted condition, and reset the data toggle for the pipe.
     * In general, this must be done after a non-control I/O call returns or completes with an error condition.  This method
     * will also clear the transaction translator if this is a 'split' pipe as described in section 11.17.5 of the 
     * USB 2.0 specification.
     *
     * @param withRequest If true the USB device request: CLEAR_FEATURE::ENDPOINT_HALT for this endnpoint request will be
     * issued on the default pipe.  See section 9.4.1 of the USB 2.0 specification for more details.
     *
     * @return IOReturn result code
     */
    virtual IOReturn clearStall(bool withRequest);
    
protected:
    virtual IOReturn adjustPipeGated(const StandardUSB::EndpointDescriptor* endpointDescriptor, const StandardUSB::SuperSpeedEndpointCompanionDescriptor* companionDescriptor);
    
    virtual IOReturn setIdlePolicyGated(uint32_t idleTimeoutMs);
    virtual IOReturn getIdlePolicyGated(uint32_t& result);
    
    virtual IOReturn clearStallGated(bool withRequest);
    
    const StandardUSB::EndpointDescriptor*                    _descriptor;
    const StandardUSB::SuperSpeedEndpointCompanionDescriptor* _companionDescriptor;

