phracker/MacOSX-SDKs/MacOSX10.11.sdk/System/Library/Frameworks/Kernel.framework/Versions/A/Headers/IOKit/usb/IOUSBHostPipe.h
    StandardUSB::EndpointDescriptor                    _currentPolicyDescriptor;
    StandardUSB::SuperSpeedEndpointCompanionDescriptor _currentPolicyCompanionDescriptor;

    // Cached values
    UInt32 _maxPacketSize;
    UInt32 _burstSize;

    UInt32 _ioIdleTimeout;

#pragma mark Control requests
public:
    /*!
     * @methodgroup Control Requests
     */
    
    /*!
     * @brief Issue an asynchronous control request on the pipe.
     *
     * @discussion This method will issue an asynchronous control request on the pipe.  A trivial example is provided below:
     *
     * <pre>
     * @textblock
     * uint8_t                    dataBuffer[4];
     * IOReturn                   result;
     * StandardUSB::DeviceRequest request;
     * IOUSBHostCompletion        completion;
     *
     * request.bmRequestType = makeDeviceRequestbmRequestType(kRequestDirectionIn, kRequestTypeClass, kRequestRecipientInterface);
     * request.bRequest      = 0x12;
     * request.wValue        = 0x3456;
     * request.wIndex        = 0x7890;
     * request.wLength       = sizeof(uint32_t);
     *
     * completion.owner     = this;
     * completion.action    = OSMemberFunctionCast(IOUSBHostCompletionAction, this, &MyDriver::controlRequestComplete);
     * completion.parameter = NULL;
     *
     * result = _controlPipe->controlRequest(this, request, &dataBuffer, &completion, 1000);<br>
     *
     * ...
     *
     * void MyDriver::controlRequestComplete(void* parameter, IOReturn status, uint32_t bytesTransferred)
     * {
     *     if(status == kIOReturnSuccess)
     *     {
     *         IOLog("received %u bytes\n", bytesTransferred);
     *     }
     *
     * @/textblock
     * </pre>
     *
     * @param forClient The object issuing the request (generally the <code>this</code> pointer).
     *
     * @param request Reference to a valid StandardUSB::DeviceRequest object.  This will be copied and can therefore be stack-allocated.
     *
     * @param dataBuffer Pointer to the memory to be used for the I/O.
     *
     * @param completion Pointer to a valid, non NULL, IOUSBHostCompletion object.  This will be copied and can therefore be stack-allocated.
     *
     * @param completionTimeoutMs Time-out of the request in milliseconds.  If 0, the request will never time-out.
     *
     * @return IOReturn result code
     */
    virtual IOReturn controlRequest(IOService* forClient, StandardUSB::DeviceRequest& request, void* dataBuffer, IOUSBHostCompletion* completion, uint32_t completionTimeoutMs);
    
    /*!
     * @brief Issue an asynchronous control request on the pipe.
     *
     * @discussion This method will issue an asynchronous control request on the pipe.  This method differs from
     * @link //apple_ref/cpp/instm/IOUSBHostPipe/controlRequest/IOReturn/(IOService*,StandardUSB::DeviceRequest%26,void*,IOUSBHostCompletion*,uint32_t) @/link
     * in that it takes an IOMemoryDescriptor instead of a void * for <code>dataBuffer</code>.
     *
     * @param forClient The object issuing the request (generally the <code>this</code> pointer).
     *
     * @param request Reference to a valid StandardUSB::DeviceRequest object.  This will be copied and can therefore be stack-allocated.
     *
     * @param dataBuffer Pointer to an IOMemoryDescriptor for the memory to be used for the I/O.
     *
     * @param completion Pointer to a valid, non NULL, IOUSBHostCompletion object.  This will be copied and can therefore be stack-allocated.
     *
     * @param completionTimeoutMs Time-out of the request in milliseconds.  If 0, the request will never time-out.
     *
     * @return IOReturn result code
     */
    virtual IOReturn controlRequest(IOService* forClient, StandardUSB::DeviceRequest& request, IOMemoryDescriptor* dataBuffer, IOUSBHostCompletion* completion, uint32_t completionTimeoutMs);
    
    /*!
     * @brief Issue a synchronous control request on the pipe.
     *
     * @discussion This method will issue a synchronous control request on the pipe. A trivial example is provided below:
     *
     * <pre>
     * @textblock
     * uint8_t                    dataBuffer[4];
     * uint32_t                   bytesTransferred;
     * IOReturn                   result;
     * StandardUSB::DeviceRequest request;
     *
     * request.bmRequestType = makeDeviceRequestbmRequestType(kRequestDirectionIn, kRequestTypeClass, kRequestRecipientInterface);
     * request.bRequest      = 0x12;
     * request.wValue        = 0x3456;
     * request.wIndex        = 0x7890;
     * request.wLength       = sizeof(uint32_t);
     *
     * result = _controlPipe->controlRequest(this, request, &dataBuffer, bytesTransferred, 1000);
     * if(result == kIOReturnSuccess)
     * {
     *     IOLog("received %u bytes\n", bytesTransferred);
     * }
     * @/textblock
     * </pre>
     *
     * @param forClient The object issuing the request (generally the <code>this</code> pointer).
     *
     * @param request Reference to a valid StandardUSB::DeviceRequest object.  This will be copied and can therefore be stack-allocated.
     *
     * @param dataBuffer Pointer to the memory to be used for the I/O.
     *
     * @param bytesTransferred Reference which will be updated with the bytes transferred during the request.
     *
     * @param completionTimeoutMs Time-out of the request in milliseconds.  If 0, the request will never time-out.
     *
     * @return IOReturn result code
     */
    virtual IOReturn controlRequest(IOService* forClient, StandardUSB::DeviceRequest& request, void* dataBuffer, uint32_t& bytesTransferred, uint32_t completionTimeoutMs);
    
    /*!
     * @brief Issue a synchronous control request on the pipe.
     *
     * @discussion This method will issue a synchronous control request on the pipe.  This method differs from
     * @link //apple_ref/cpp/instm/IOUSBHostPipe/controlRequest/IOReturn/(IOService*,StandardUSB::DeviceRequest%26,void*,uint32_t%26,uint32_t) @/link
     * in that it takes an IOMemoryDescriptor instead of a void * for <code>dataBuffer</code>.
     *
     * @param forClient The object issuing the request (generally the <code>this</code> pointer).
     *
     * @param request Reference to a valid StandardUSB::DeviceRequest object.  This will be copied and can therefore be stack-allocated.
     *
     * @param dataBuffer Pointer to an IOMemoryDescriptor for the memory to be used for the I/O.
     *
     * @param bytesTransferred Reference which will be updated with the bytes transferred during the request.
     *
     * @param completionTimeoutMs Time-out of the request in milliseconds.  If 0, the request will never time-out.
     *
     * @return IOReturn result code
     */
    virtual IOReturn controlRequest(IOService* forClient, StandardUSB::DeviceRequest& request, IOMemoryDescriptor* dataBuffer, uint32_t& bytesTransferred, uint32_t completionTimeoutMs);

protected:
    struct tInternalControlRequestParameters
    {
        IOService*                  forClient;
        StandardUSB::DeviceRequest* request;
        void*                       rawBuffer;
        IOMemoryDescriptor*         descriptorBuffer;
        uint32_t*                   bytesTransferred;
        IOUSBHostCompletion*        completion;
        uint32_t                    completionTimeoutMs;
    };
    virtual IOReturn controlRequestGated(tInternalControlRequestParameters& parameters);

    static void rawBufferControlRequestCompletion(void* target, void* parameter, IOReturn status, uint32_t bytesTransferred);

#pragma mark IO
public:
    /*!
     * @methodgroup I/O
     *
     * @discussion All I/O calls will synchronize with the workloop.  Furthermore, all completion callbacks will also
     * synchronize with the workloop.  Therefore, when using the asynchronous I/O methods it is most performant to make
     * subsequent calls from completion callback as the workloop lock will already be owned.
     */
    
    /*!
     * @brief Issue an asynchronous I/O request
     *
     * @discussion See IOUSBHostIOSource::io for documentation

