phracker/MacOSX-SDKs/MacOSX10.11.sdk/System/Library/Frameworks/Kernel.framework/Versions/A/Headers/IOKit/usb/IOUSBHostPipe.h
     * @param completionTimeoutMs Must be 0 for interrupt endpoints.
     */
    virtual IOReturn io(IOMemoryDescriptor* dataBuffer, uint32_t dataBufferLength, IOUSBHostCompletion* completion, uint32_t completionTimeoutMs = 0);
    
    /*!
     * @brief Issue a synchronous I/O request
     *
     * @discussion See IOUSBHostIOSource::io for documentation
     *
     * @param completionTimeoutMs Must be 0 for interrupt endpoints.
     */
    virtual IOReturn io(IOMemoryDescriptor* dataBuffer, uint32_t dataBufferLength, uint32_t& bytesTransferred, uint32_t completionTimeoutMs = 0);
    
    /*!
     * @brief Issue an I/O request to an isochronous pipe.
     *
     * @discussion This method is used to issue isochronout I/O requests.  To ensure minimal latency the
     * IOUSBHostIsochronousFrame::status and IOUSBHostIsochronousFrame::completeCount fields of <code>frameList</code> are
     * updated at interrupt time.  In the case of an asynchronous call, this allows software to peek at the frame list and
     * detect completed frames prior to receiving the completion callback.
     *
     * @param dataBuffer Pointer to a valid memory descriptor to be used as the backing store for the I/O.
     *
     * @param frameList Pointer to the frame list describing the request.  See <link>IOUSBHostIsochronousFrame</link> for
     * information regarding structure initialization requirements and usage.
     *
     * @param frameListCount Number of elements in <code>frameList</code>.
     *
     * @param firstFrameNumber Frame number which this request should begin on.  The current frame number can be queried via
     * <code>IOUSHostDevice::getFrameNumber()</code> or <code>IOUSBHostInterface::getFrameNumber()</code> .  If 0, the request
     * will be enqueued on the next available frame.
     *
     * @param completion To create a synchronous I/O request, this parameter must be NULL.  For an asynchronous request this
     * paramater must be properly filled out prior to calling this method.  If not NULL, this parameter will be copied and
     * can therefore be stack-allocated.
     *
     * @return IOReturn result code
     */
    virtual IOReturn io(IOMemoryDescriptor* dataBuffer, IOUSBHostIsochronousFrame* frameList, uint32_t frameListCount, uint64_t firstFrameNumber = 0, IOUSBHostIsochronousCompletion* completion = NULL);
    
protected:
    virtual IOReturn isochronousIoGated(tInternalDataTransferParameters& parameters);
    
#pragma mark Streams
public:
    /*!
     * @methodgroup Streams
     */
    
    /*!
     * @brief Enable streams for the IOUSBHostPipe
     * 
     * @discussion This method changes the operational mode of the IOUSBHostPipe to allow streaming endpoint
     * transfers, and must be called before copyStream will return any IOUSBHostStream objects.
     *
     * @return IOReturn result code.  An error will be returned if the pipe, device, or underlying host
     * controller does not support streams.
     */
    virtual IOReturn enableStreams();
    
    /*!
     * @brief Disable streams for the IOUSBHostPipe
     *
     * @discussion This method changes the operational mode of the IOUSBHostPipe to disable streaming endpoint
     * transfers.  Calling this method will synchronously abort any outstanding calls on existing IOUSBHostStream
     * objects, and therefore all stream contexts should first be set as non-active on the device via an out-of-band
     * (class-defined) mechanism.
     *
     * @return IOReturn result code.  An error will be returned if streams were not enabled for this IOUSBHostPipe.
     */
    virtual IOReturn disableStreams();
    
    /*!
     * @brief Return the stream associated with <code>streamID</code>
     *
     * @discussion This method will return the stream associated with <code>streamID</code>.  If the stream
     * doesn't exist yet it will be created.  This method returns a <code>retain()</code>ed object that must
     * be <code>release()</code>ed by the caller.  <code>IOUSBHostPipe::enableStreams</code> must be called before
     * this method will return a stream object.
     *
     * @param streamID Stream ID in the range of 1 to <code>max</code>, where <code>max</code> can be retrieved
     * by calling <code>StandardUSB::getEndpointMaxStreams</code> with the endpoint descriptors.
     *
     * @return Pointer to a retain()ed IOUSBHostStream object or NULL.  NULL may be returned if either the device
     * or the underlying host controller do not support that stream ID.
     */
    virtual IOUSBHostStream* copyStream(uint32_t streamID);
    
protected:
    virtual IOReturn enableStreamsGated();
    
    virtual IOReturn disableStreamsGated();
    
    virtual IOReturn copyStreamGated(uint32_t streamID, IOUSBHostStream*& result);

    IOUSBHostStream** _streamArray;
    bool              _streamsEnabled;
    
#pragma mark Miscellaneous
public:
    virtual uint8_t getSpeed() const;
    
    virtual tUSBHostDeviceAddress getDeviceAddress() const;
    
protected:
    struct tRawBufferControlRequestCompletionParameter
    {
        IOMemoryDescriptor* memoryDescriptor;
        IOUSBHostCompletion clientCompletion;
    };

#pragma mark Deprecated
public:
    enum tPipeAbortOptions
    {
        kIOUSBPipeAbortAsync = 0,
        kIOUSBPipeAbortSync  = 1
    };

    enum tUSBPipeState
    {
        kUSBPipeStateReady,
        kUSBPipeStateRunningCompletions,
        kUSBPipeStateAborting,
        kUSBPipeStateInactive
    };

    /*!
     * @brief This method is deprecated. Please use copyStream instead.
     * Return the stream associated with <code>streamID</code>
     *
     * @discussion This method will return the stream associated with <code>streamID</code>.  If the stream
     * doesn't exist yet it will be created.  This method returns a <code>retain()</code>ed object that must
     * be <code>release()</code>ed by the caller.  <code>IOUSBHostPipe::enableStreams</code> must be called before
     * this method will return a stream object.
     *
     * @param streamID Stream ID in the range of 1 to <code>max</code>, where <code>max</code> can be retrieved
     * by calling <code>StandardUSB::getEndpointMaxStreams</code> with the endpoint descriptors.
     *
     * @return Pointer to a retain()ed IOUSBHostStream object or NULL.  NULL may be returned if either the device
     * or the underlying host controller do not support that stream ID.
     */
    virtual IOUSBHostStream* getStream(uint32_t streamID) __attribute__((deprecated));
    
    // IOUSBHostPipe::tUSBPipeState GetPipeState() __attribute__((deprecated));
    // Replacement: getState

    // virtual IOReturn Abort(IOOptionBits options = kIOUSBPipeAbortAsync, IOReturn withError = kIOReturnAborted) __attribute__((deprecated));
    // Replacement: abort

    // virtual IOReturn Reset(void) __attribute__((deprecated));
    // virtual IOReturn ClearStall(void) __attribute__((deprecated));
    // Replacement: clearStall(false)

    // virtual IOReturn ClearPipeStall(bool withDeviceRequest = false) __attribute__((deprecated));
    // Replacement: clearStall

