phracker/MacOSX-SDKs/MacOSX10.11.sdk/System/Library/Frameworks/Kernel.framework/Versions/A/Headers/IOKit/usb/IOUSBHostPipe.h
    // virtual IOReturn Read(IOMemoryDescriptor* buffer,
    //                       IOUSBCompletion*    completion = 0,
    //                       UInt32*             bytesRead = 0) __attribute__((deprecated));
    // virtual IOReturn Read(IOMemoryDescriptor* buffer,
    //                       UInt64 frameStart, UInt32 numFrames, IOUSBIsocFrame* frameList,
    //                       IOUSBIsocCompletion* completion = 0) __attribute__((deprecated));
    // virtual IOReturn Read(IOMemoryDescriptor* buffer,
    //                       UInt32              noDataTimeout,
    //                       UInt32              completionTimeout,
    //                       IOUSBCompletion*    completion = 0,
    //                       UInt32*             bytesRead = 0) __attribute__((deprecated));
    // virtual IOReturn Read(IOMemoryDescriptor* buffer,
    //                       UInt64 frameStart, UInt32 numFrames, IOUSBLowLatencyIsocFrame* frameList,
    //                       IOUSBLowLatencyIsocCompletion*       completion = 0, UInt32 updateFrequency = 0) __attribute__((deprecated));
    // virtual IOReturn Read(IOMemoryDescriptor* buffer,
    //                       UInt32              noDataTimeout,
    //                       UInt32              completionTimeout,
    //                       IOByteCount         reqCount,
    //                       IOUSBCompletion*    completion = 0,
    //                       UInt32*             bytesRead = 0) __attribute__((deprecated));
    // virtual IOReturn Read(IOMemoryDescriptor*           buffer,
    //                       UInt32                        noDataTimeout,
    //                       UInt32                        completionTimeout,
    //                       IOByteCount                   reqCount,
    //                       IOUSBCompletionWithTimeStamp* completion = 0,
    //                       UInt32*                       bytesRead = 0) __attribute__((deprecated));
    // virtual IOReturn Write(IOMemoryDescriptor* buffer,
    //                        IOUSBCompletion*    completion = 0) __attribute__((deprecated));
    // virtual IOReturn Write(IOMemoryDescriptor* buffer,
    //                        UInt64 frameStart, UInt32 numFrames, IOUSBIsocFrame* frameList,
    //                        IOUSBIsocCompletion* completion = 0) __attribute__((deprecated));
    // virtual IOReturn Write(IOMemoryDescriptor* buffer,
    //                        UInt32              noDataTimeout,
    //                        UInt32              completionTimeout,
    //                        IOUSBCompletion*    completion = 0) __attribute__((deprecated));
    // virtual IOReturn Write(IOMemoryDescriptor* buffer,
    //                        UInt32              noDataTimeout,
    //                        UInt32              completionTimeout,
    //                        IOByteCount         reqCount,
    //                        IOUSBCompletion*    completion = 0) __attribute__((deprecated));
    // virtual IOReturn Write(IOMemoryDescriptor* buffer,
    //                        UInt64 frameStart, UInt32 numFrames, IOUSBLowLatencyIsocFrame* frameList,
    //                        IOUSBLowLatencyIsocCompletion* completion = 0, UInt32 updateFrequency = 0) __attribute__((deprecated));
    // Replacement: io

    // virtual IOReturn ControlRequest(IOUSBDevRequestDesc* request, IOUSBCompletion* completion = NULL,
    //                                 UInt32 noDataTimeout = kUSBHostDefaultControlNoDataTimeoutMS, UInt32 completionTimeout = kUSBHostDefaultControlCompletionTimeoutMS) __attribute__((deprecated));
    // virtual IOReturn ControlRequest(IOUSBDevRequest* request, IOUSBCompletion* completion = NULL) __attribute__((deprecated));
    // virtual IOReturn ControlRequest(IOUSBDevRequestDesc* request, UInt32 noDataTimeout, UInt32 completionTimeout, IOUSBCompletion* completion = 0) __attribute__((deprecated));
    // virtual IOReturn ControlRequest(IOUSBDevRequest* request, UInt32 noDataTimeout, UInt32 completionTimeout, IOUSBCompletion* completion = 0) __attribute__((deprecated));
    // Replacement: controlRequest

    // virtual const AppleUSBHostController::Endpoint* GetEndpoint() __attribute__((deprecated));
    // virtual const StandardUSB::EndpointDescriptor* GetEndpointDescriptor(tGetEndpointDescriptorOptions type = kGetEndpointDescriptorOriginal) __attribute__((deprecated));
    // virtual const StandardUSB::SuperSpeedEndpointCompanionDescriptor* GetEndpointCompanionDescriptor(tGetEndpointDescriptorOptions type = kGetEndpointDescriptorOriginal) __attribute__((deprecated));
    // virtual UInt8 GetDirection() __attribute__((deprecated));
    // virtual UInt8 GetType() __attribute__((deprecated));
    // virtual UInt8            GetEndpointNumber() __attribute__((deprecated));
    // virtual UInt16           GetMaxPacketSize() __attribute__((deprecated));
    // virtual UInt16           GetBurstSize() __attribute__((deprecated));
    // virtual UInt8            GetInterval() __attribute__((deprecated));
    // Replacement: getEndpointDescriptor and getEndpointCompanionDescriptor

    // virtual tUSBHostDeviceAddress GetAddress() __attribute__((deprecated));
    // Replacement: getDeviceAddress
    
    // virtual UInt8            GetSpeed() __attribute__((deprecated));
    // Replacement: getSpeed
    
    // virtual IOReturn GetPipeStatus(void) __attribute__((deprecated));
    // Replacement: none

    // virtual IOReturn SetPipePolicy(UInt16 maxPacketSize, UInt8 maxInterval) __attribute__((deprecated));
    // Replacement: adjustPipe

    // virtual void OverrideIdlePolicy(bool override, UInt32 ioIdleTimeout = 0) __attribute__((deprecated));
    // Replacement: setIdlePolicy

    // virtual void GetIdlePolicy(UInt32& ioIdleTimeout) __attribute__((deprecated));
    // Replacement: setIdlePolicy

    // virtual IOReturn Read(UInt32              streamID,
    //                       IOMemoryDescriptor* buffer,
    //                       UInt32              noDataTimeout,
    //                       UInt32              completionTimeout,
    //                       IOByteCount         reqCount,
    //                       IOUSBCompletion*    completion = 0,
    //                       IOByteCount*        bytesRead = 0) __attribute__((deprecated));
    // virtual IOReturn Write(UInt32              streamID,
    //                        IOMemoryDescriptor* buffer,
    //                        UInt32              noDataTimeout,
    //                        UInt32              completionTimeout,
    //                        IOByteCount         reqCount,
    //                        IOUSBCompletion*    completion = 0) __attribute__((deprecated));
    // virtual IOReturn Abort(UInt32 streamID, IOOptionBits options, IOReturn withError) __attribute__((deprecated));
    // virtual UInt32 GetConfiguredStreams(void) __attribute__((deprecated));
    // Replacement: copyStream and IOUSBHostStream interfaces

    // virtual UInt32 SupportsStreams(void) __attribute__((deprecated));
    // Replacement: StandardUSB::getEndpointMaxStreams

    // virtual IOReturn CreateStreams(UInt32 maxStreams) __attribute__((deprecated));
    // Replacement: enableStreams
    
    // virtual const StandardUSB::SuperSpeedEndpointCompanionDescriptor* GetSuperSpeedEndpointCompanionDescriptor(tGetEndpointDescriptorOptions type = kGetEndpointDescriptorOriginal) __attribute__((deprecated));
    // Replacement: getSuperSpeedEndpointCompanionDescriptor

    // virtual UInt8 GetMaxBurst() __attribute__((deprecated));
    // virtual UInt8 GetMult() __attribute__((deprecated));
    // virtual UInt16 GetBytesPerInterval() __attribute__((deprecated));
    // Replacement: StandardUSB::getEndpoint*
};

#endif // IOUSBHostFamily_IOUSBHostPipe_h
